# python 3.7.4
# coding = utf8
# filename datasets.py
# author 463714869@qq.com/www.cdzcit.com,
#        create by VIM at 2019/12/30


# Choice API错误代码字典
EMQuantErrDict = {
    0: 'EQERR_SECUSS成功',
    10001001: 'EQERR_NO_LOGIN用户未登陆',
    10001002: 'EQERR_USERNAMEORPASSWORD_ERR用户名或密码错误',
    10001003: 'EQERR_NO_ACCESS用户无API权限',
    10001004: 'EQERR_ACCESS_EXPIRE用户API权限过期',
    10001005: 'EQERR_GETUSERINFO_FAIL获取用户信息失败',
    10001006: 'EQERR_DLLVESION_EXPIREDLL版本号过期',
    10001007: 'EQERR_NO_LV2_ACCESS用户无API_LV2权限',
    10001008: 'EQERR_LV2_ACCESS_EXPIRE用户API_LV2权限过期',
    10001009: 'EQERR_LOGIN_COUNT_LIMIT账号登陆数达到上限',
    10001010: 'EQERR_LOGIN_FAIL用户登陆失败',
    10001011: 'EQERR_LOGIN_DISCONNECT用户登陆掉线',
    10001012: 'EQERR_ACCESS_INSUFFICIENCE用户权限不足',
    10001013: 'EQERR_IS_LOGIN用户正在登录',
    10001014: 'EQERR_NEED_ACTIVATE需要登录激活',
    10001015: 'EQERR_LOGIN_SERVICE_ERR登录服务异常',
    10001016: 'EQERR_IS_MANUAL_ACTIVATE正在人工激活',
    10001017: 'EQERR_NOTNEED_MANUAL_ACTIVATE无需人工激活',
    10001018: 'EQERR_MANUAL_ACTIVATE_FAIL人工激活失败',
    10001019: 'EQERR_DIFFRENT_DEVICE激活设备与登录设备不一致',
    10001020: 'EQERR_USERINFO_EXPIREDuserInfo已失效需重新激活',
    10001021: 'EQERR_QUOTE_LOGIN_FAIL行情服务登录验证失败',
    10001022: 'EQERR_QUOTE_FLOW_FAIL行情服务流量验证失败',
    10001023: 'EQERR_INFOQUERY_LOGIN_FAIL资讯查询服务登录验证失败',
    10001024: 'EQERR_INFOSUB_LOGIN_FAIL资讯订阅服务登录验证失败',
    10001025: 'EQERR_INFO_FLOW_FAIL资讯服务流量验证失败',
    10000001: 'EQERR_GET_TRADE_FAIL获取交易日失败',
    10000002: 'EQERR_INIT_OBTAIN_CLASS_FAIL初始化主类失败',
    10000003: 'EQERR_NEW_MEM_FAIL申请内存失败',
    10000004: 'EQERR_PARSE_DATA_ERR解析数据错误',
    10000005: 'EQERR_UNGZIP_DATA_FAILgzip解压失败',
    10000006: 'EQERR_UNKNOWN_ERR未知错误',
    10000007: 'EQERR_FUNCTION_INTERNAL_ERR函数内部错误',
    10000008: 'EQERR_OUTOF_BOUNDS数组越界',
    10000009: 'EQERR_NO_DATA无数据',
    10000010: 'EQERR_SYSTEM_ERROR系统级别错误',
    10000011: 'EQERR_SERVERLIST_ERROR服务器列表错误',
    10000012: 'EQERR_OPERATION_FAILURE操作失败',
    10000013: 'EQERR_SERVICE_ERROR服务错误',
    10000014: 'EQERR_GETSERVERLIST_FAIL获取服务器列表失败',
    10000015: 'EQERR_SERVICE_TIMEOUT服务超时',
    10000016: 'EQERR_FREQUENCY_OVER请求频次过高',
    10000017: 'EQERR_OVERSEAS_IP_RESTRICTED海外IP受限',
    10000018: 'EQERR_POP_GROUP_NOT_SUPPORTPOP组合不支持此操作',
    10002001: 'EQERR_SOCKET_ERR网络错误',
    10002002: 'EQERR_CONNECT_FAIL网络连接失败',
    10002003: 'EQERR_CONNECT_TIMEOUT网络连接超时',
    10002004: 'EQERR_RECVCONNECTION_CLOSED网络接收时连接断开',
    10002005: 'EQERR_SENDSOCK_FAIL网络发送失败',
    10002006: 'EQERR_SENDSOCK_TIMEOUT网络发送超时',
    10002007: 'EQERR_RECVSOCK_FAIL网络接收错误',
    10002008: 'EQERR_RECVSOCK_TIMEOUT网络接收超时',
    10002009: 'EQERR_QUOTE_RECONNECT_FAIL行情服务器连续重连失败',
    10002010: 'EQERR_HTTP_FAILhttp访问失败',
    10002011: 'EQERR_WAIT_NET_RES_TIMEOUT等待网络响应超时',
    10002012: 'EQERR_QUOTE_RECONNECT行情服务器重连',
    10002013: 'EQERR_INFO_RECONNECT资讯服务器重连',
    10002014: 'EQERR_INFO_RECONNECT_FAIL资讯服务器连续重连失败',
    10003001: 'EQERR_INPARAM_EMPTY传入参数为空',
    10003002: 'EQERR_OUTPARAM_EMPTY传出参数为空',
    10003003: 'EQERR_PARAM_ERR参数错误',
    10003004: 'EQERR_START_DATE_ERR起始日期格式不正确',
    10003005: 'EQERR_END_DATE_ERR截止日期格式不正确',
    10003006: 'EQERR_START_BIGTHAN_END起始日期大于截至日期',
    10003007: 'EQERR_DATE_ERR日期格式不正确',
    10003008: 'EQERR_CODE_INVALIED无效的证券代码',
    10003009: 'EQERR_CODE_REPEAT证券代码重复',
    10003010: 'EQERR_INDICATOR_INVALIED无效的指标',
    10003011: 'EQERR_USERNAME_EMPTY用户名为空',
    10003012: 'EQERR_PASSWORD_EMPTY密码为空',
    10003013: 'EQERR_TO_UPPER_LIMIT订阅数或股票总数达到上限',
    10003014: 'EQERR_MIXED_INDICATOR不支持的混合指标',
    10003015: 'EQERR_INDICATOR_TO_UPPER_LIMIT单次订阅指标达到上限',
    10003016: 'EQERR_BEYOND_DATE_SUPPORT超出日期支持范围',
    10003017: 'EQERR_BASE_LESS_THAN_END复权基期小于截止日期',
    10003018: 'EQERR_MIXED_CODES_MARKET不支持的混合证券品种',
    10003019: 'EQERR_NO_SUPPORT_CODES_MARKET不支持的证券代码品种',
    10003020: 'EQERR_ORDER_TO_UPPER_LIMIT交易条数超过上限',
    10003021: 'EQERR_NO_SUPPORT_ORDERINFO不支持的交易信息',
    10003022: 'EQERR_INDICATOR_REPEAT指标重复',
    10003023: 'EQERR_INFOBKCODE_INVALIED资讯板块代码错误',
    10003024: 'EQERR_INFOSIZE_TOOLARGE资讯数据量过大',
    10003025: 'EQERR_INFO_SEARCH_NODATA资讯查询不到数据',
    10003026: 'EQERR_INFOBKCODE_REPEAT资讯板块代码重复'
}

# 证券代码字典
EMQuantCodesList_Market = [
    # 市场类
    {'市场类': {
        '001004': '全部A股',
        '001048': '全部A股非ST',
        '001005': '上证A股',
        '001006': '深证A股',
        '001007': '深证主板A股',
        '001009': '中小板',
        '001031': '深证主板A股(含ST,*ST)',
        '001032': '中小板(含ST,*ST)',
        '001010': '创业板',
        '001057': '科创板',
        '001011': '全部B股',
        '001059': '科创股票',
        '001012': '上证B股',
        '001064': '科创板（含意向申报）',
        '001060': '科创CDR',
        '001013': '深证B股',
        '001001': '全部AB股',
        '001002': '上证AB股',
        '001003': '深证AB股',
        '001008': '深证主板',
        '001044': '全部A股(非金融石油石化)',
        '001038': '沪股通',
        '001039': '沪股通AH股',
        '001041': '深股通',
        '001042': '深股通AH股',
        '001047': '沪深股通',
        '001017': 'ST',
        '001018': '*ST',
        '001023': '风险警示股票',
        '001024': '风险警示股票（上交所）',
        '001025': '风险警示股票（深交所）',
        '001026': '退市整理股票',
        '001027': '退市整理股票（上交所）',
        '001061': '科创风险提示',
        '001028': '退市整理股票（深交所）',
        '001043': '首发申报',
        '001037': '首发过会',
        '001019': '正在发行的股票',
        '001020': '已发行待上市股票',
        '001030': 'IPO审核通过暂缓发行',
        '001029': 'IPO审核通过尚未发行股票',
        '001021': '首发上会',
        '001022': 'IPO审核未通过股票',
        '001058': 'IPO取消审核的股票',
        '001016': '暂停上市股票',
        '001015': '已摘牌股票',
        '001014': '三板股票',
        '001045': '融资融券标的(含ETF)',
        '001046': '可转债标的',
        '001056': '沪股通AL股'
    }}
]

EMQuantCodesList_DongCai = [
    # 东财行业类
    {'农林牧渔': {
        '农业': {
            '004001001001': '种子',
            '004001001002': '种植业',
            '004001001003': '农产品加工',
            '004001001004': '农业服务'
        },
        '林业': {
            '004001002001': '林业种植',
            '004001002002': '木材加工'
        },
        '畜牧业': {
            '004001003001': '养殖',
            '004001003002': '饲料',
            '004001003003': '动物用药'
        },
        '渔业': {
            '004001004001': '淡水渔业',
            '004001004002': '海洋渔业'
        }
    }},

    {'食品饮料': {
        '食品': {
            '004002001001': '肉制品',
            '004002001002': '乳制品',
            '004002001003': '调味品',
            '004002001004': '食品综合'
        },
        '饮料': {
            '004002002001': '啤酒',
            '004002002002': '白酒',
            '004002002003': '软饮料',
            '004002002004': '葡萄酒',
            '004002002005': '黄酒',
            '004002002006': '其他酒类'
        }
    }},

    {'纺织服装': {
        '纺织': {
            '004003001001': '棉纺',
            '004003001002': '毛纺',
            '004003001003': '丝绸',
            '004003001004': '印染',
            '004003001005': '其他纺织'
        },
        '服装家纺': {
            '004003004001': '服装',
            '004003004002': '服饰辅料',
            '004003004003': '家纺'
        }
    }},

    {'轻工制造': {
        '造纸印刷': {
            '004004001001': '造纸',
            '004004001002': '包装印刷'
        },
        '家具': {
            '004004002001': '家具制造'
        },
        '珠宝首饰': {
            '004004003001': '珠宝首饰'
        },
        '文娱用品': {
            '004004004001': '文化用品',
            '004004004002': '娱乐用品',
            '004004004003': '其他文娱用品'
        },
        '其他轻工': {
            '004004005001': '其他轻工'
        }
    }},

    {'化石能源': {
        '石油天然气': {
            '004005001001': '石油天然气开采',
            '004005001002': '石油天然气贸易',
            '004005001003': '石油加工',
            '004005001004': '油田服务'
        },
        '煤炭': {
            '004005002001': '煤炭开采洗选',
            '004005002002': '焦炭'
        }
    }},

    {'基础化工': {
        '化学原料': {
            '004006001001': '纯碱',
            '004006001002': '氯碱',
            '004006001003': '氟化工',
            '004006001004': '磷化工',
            '004006001005': '聚氨酯',
            '004006001006': '无机盐',
            '004006001007': '其他化学原料'
        },
        '化肥农药': {
            '004006002001': '氮肥',
            '004006002002': '磷肥',
            '004006002003': '钾肥',
            '004006002004': '复合肥',
            '004006002005': '农药'
        },
        '合成纤维及树脂': {
            '004006003001': '涤纶',
            '004006003002': '锦纶',
            '004006003003': '氨纶',
            '004006003004': '粘胶纤维',
            '004006003005': '合成树脂',
            '004006003006': '维纶',
            '004006003007': '玻纤',
            '004006003008': '其他纤维'
        },
        '化学制品': {
            '004006004001': '日用化学品',
            '004006004002': '民爆用品',
            '004006004003': '涂料涂漆',
            '004006004004': '印染化学品',
            '004006004005': '塑料制品',
            '004006004006': '其他化学制品'
        },
        '化学新材料': {
            '004006005001': '化学新材料'
        },
        '橡胶制品': {
            '004006006001': '轮胎',
            '004006006002': '其他橡胶制品'
        }
    }},

    {'钢铁': {
        '钢铁': {
            '004007001001': '普钢',
            '004007001002': '特钢'
        },
        '铁矿石': {
            '004007002001': '铁矿石'
        }
    }},

    {'有色金属': {
        '基本金属': {
            '004008001001': '铝',
            '004008001002': '铜',
            '004008001003': '铅锌',
            '004008001004': '锡'
        },
        '贵金属': {
            '004008002001': '黄金'
        },
        '稀有金属': {
            '004008003001': '稀土',
            '004008003002': '钨',
            '004008003003': '锂',
            '004008003004': '其他稀有小金属'
        },
        '金属非金属新材料': {
            '004008004001': '磁性材料',
            '004008004002': '电池材料',
            '004008004003': '其他金属新材料',
            '004008004004': '非金属新材料'
        }
    }},

    {'机械设备': {
        '通用设备': {
            '004009001001': '机床设备',
            '004009001002': '起重运输设备',
            '004009001003': '内燃机',
            '004009001004': '制冷空调设备',
            '004009001005': '基础件',
            '004009001006': '仪器仪表',
            '004009001007': '其他通用机械'
        },
        '专用设备': {
            '004009002001': '工程机械',
            '004009002002': '矿山冶金机械',
            '004009002003': '纺织服装机械',
            '004009002004': '楼宇设备',
            '004009002005': '环保设备',
            '004009002006': '农用机械',
            '004009002007': '印刷包装机械',
            '004009002008': '其他专用机械'
        },
        '金属制品': {
            '004009003001': '金属制品'
        },
        '机器人': {
            '004009004001': '工业机器人',
            '004009004002': '服务机器人'
        }
    }},

    {'国防与装备': {
        '航空航天装备': {
            '004010001001': '航天装备',
            '004010001002': '航空装备'
        },
        '地面装备': {
            '004010002001': '地面装备'
        },
        '船舶与海洋装备': {
            '004010003001': '船舶制造',
            '004010003002': '海洋工程装备'
        }
    }},

    {'交运设备': {
        '汽车': {
            '004011001001': '乘用车',
            '004011001002': '商用车',
            '004011001003': '其他专用车辆',
            '004011001004': '汽车零部件',
            '004011001005': '汽车销售',
            '004011001006': '汽车服务'
        },
        '摩托车': {
            '004011002001': '摩托车'
        },
        '铁路设备': {
            '004011003001': '铁路车辆及动车组',
            '004011003002': '铁路专用设备及器材',
            '004011003003': '其他铁路设备'
        },
        '其他交运设备': {
            '004011004001': '其他交运设备'
        },
        '轨道交通设备': {
            '004011005001': '轨道交通设备'
        }
    }},

    {'电气设备': {
        '电机': {
            '004012001001': '电机'
        },
        '输变电设备': {
            '004012002001': '电气自控设备',
            '004012002002': '电线电缆',
            '004012002003': '电气仪表',
            '004012002004': '其他输变电设备'
        },
        '电源设备': {
            '004012003001': '太阳能',
            '004012003002': '风能',
            '004012003003': '核能',
            '004012003004': '综合电力设备商',
            '004012003005': '储能设备',
            '004012003006': '其他电源设备'
        },
        '其他电气设备': {
            '004012004001': '其他电气设备'
        }
    }},

    {'家电': {
        '白色家电': {
            '004013001001': '白色家电'
        },
        '视听器材': {
            '004013002001': '视听器材'
        },
        '小家电': {
            '004013003001': '小家电'
        },
        '照明设备': {
            '004013004001': '照明设备'
        },
        '其他家电': {
            '004013005001': '其他家电'
        }
    }},

    {'电子设备': {
        '半导体': {
            '004014001001': '半导体分立器件',
            '004014001002': '集成电路',
            '004014001003': '半导体材料'
        },
        '电子元件': {
            '004014002001': '电子元件'
        },
        '电子器件': {
            '004014003001': '显示器件',
            '004014003002': '其他电子器件'
        },
        '电子设备制造': {
            '004014004001': '电子设备制造'
        },
        '光电子器件': {
            '004014005001': 'LED',
            '004014005002': '光学元件'
        },
        '消费电子设备': {
            '004014006001': '消费电子设备'
        }
    }},

    {'信息技术': {
        '计算机硬件': {
            '004015001001': 'PC、服务器及硬件',
            '004015001002': '专用计算机设备'
        },
        '计算机软件': {
            '004015002001': '基础软件',
            '004015002002': '行业应用软件',
            '004015002003': '其他软件服务'
        },
        '通信设备': {
            '004015003001': '通信终端设备',
            '004015003002': '通信传输设备',
            '004015003003': '通信配套服务'
        },
        '通信运营': {
            '004015004001': '通信运营'
        },
        '卫星应用': {
            '004015005001': '卫星应用'
        }
    }},

    {'文化传媒': {
        '平面媒体': {
            '004016001001': '平面媒体'
        },
        '广播电视': {
            '004016002001': '有线电视',
            '004016002002': '网络电视'
        },
        '营销服务': {
            '004016003001': '营销服务'
        },
        '影视动漫': {
            '004016004001': '影视',
            '004016004002': '动漫'
        },
        '体育': {
            '004016005001': '赛事运营与传播',
            '004016005002': '体育彩票',
            '004016005003': '体育服务'
        },
        '教育': {
            '004016006001': '幼儿教育',
            '004016006002': '成人教育',
            '004016006003': '在线教育',
            '004016006004': '教育信息化服务'
        }
    }},

    {'互联网': {
        '互联网服务': {
            '004017001001': '网络媒体',
            '004017001002': '游戏娱乐',
            '004017001003': '网上社交',
            '004017001004': '综合互联网服务',
            '004017001005': '其他互联网服务'
        },
        '互联网商务': {
            '004017002001': '网上购物',
            '004017002002': '电子商务B2B',
            '004017002003': '生活服务O2O'
        },
        '互联网金融': {
            '004017003001': '融资借贷',
            '004017003002': '网上理财',
            '004017003003': '第三方支付',
            '004017003004': '其他互联网金融'
        },
        '互联网技术': {
            '004017004001': '云服务(含IDC、CDN)',
            '004017004002': '搜索'
        },
        '其他互联网应用': {
            '004017005001': '其他互联网应用'
        }
    }},

    {'医药生物': {
        '化学制药': {
            '004018001001': '化学原料药',
            '004018001002': '化学制剂',
            '004018001003': '化学辅料药'
        },
        '中药生产': {
            '004018002001': '中药生产'
        },
        '生物医药': {
            '004018003001': '生物医药'
        },
        '医疗器械': {
            '004018004001': '医疗器械'
        },
        '医药商业': {
            '004018005001': '医药商业'
        },
        '医疗服务': {
            '004018006001': '医疗服务'
        },
        '保健护理': {
            '004018007001': '保健护理产品',
            '004018007002': '保健护理服务'
        }
    }},

    {'休闲、生活及专业服务': {
        '休闲服务': {
            '004019001001': '餐饮',
            '004019001002': '酒店',
            '004019001003': '景区',
            '004019001004': '旅游服务',
            '004019001005': '其他休闲服务'
        },
        '生活服务': {
            '004019002001': '生活服务'
        },
        '专业服务': {
            '004019003001': '家政服务',
            '004019003002': '调查与咨询服务',
            '004019003003': '建筑装饰设计',
            '004019003004': '其他专业服务'
        }
    }},

    {'商贸零售': {
        '零售': {
            '004020001001': '百货',
            '004020001002': '超市',
            '004020001003': '连锁'
        },
        '贸易': {
            '004020002001': '贸易'
        },
        '商业物业经营': {
            '004020003001': '专业市场',
            '004020003002': '一般物业经营'
        }
    }},

    {'建材': {
        '水泥': {
            '004021001001': '水泥'
        },
        '玻璃': {
            '004021002001': '玻璃'
        },
        '陶瓷': {
            '004021003001': '陶瓷'
        },
        '耐火材料': {
            '004021004001': '耐火材料'
        },
        '其他建材': {
            '004021005001': '管材',
            '004021005002': '其他建材'
        }
    }},

    {'建筑': {
        '建筑施工': {
            '004022001001': '房屋建筑',
            '004022001002': '园林工程',
            '004022001003': '专业工程'
        },
        '钢结构': {
            '004022002001': '钢结构'
        },
        '装修装饰': {
            '004022003001': '装修装饰'
        },
        '基础建设': {
            '004022004001': '路桥建设',
            '004022004002': '水利建设',
            '004022004003': '铁路城轨建设',
            '004022004004': '其他基础建设'
        }
    }},

    {'交通运输': {
        '航空机场': {
            '004023001001': '航空',
            '004023001002': '机场'
        },
        '港口航运': {
            '004023002001': '港口',
            '004023002002': '航运'
        },
        '公路铁路': {
            '004023003001': '高速公路',
            '004023003002': '公交',
            '004023003003': '铁路运输'
        },
        '物流': {
            '004023004001': '物流'
        }
    }},

    {'公共事业': {
        '电力': {
            '004024001001': '火电',
            '004024001002': '水电',
            '004024001003': '热电',
            '004024001004': '新能源发电',
            '004024001005': '其他发电'
        },
        '燃气': {
            '004024002001': '燃气'
        },
        '水务': {
            '004024003001': '水务'
        },
        '环保': {
            '004024004001': '空气',
            '004024004002': '环保'
        }
    }},

    {'金融': {
        '银行': {
            '004025001001': '国有银行',
            '004025001002': '股份制与城商行'
        },
        '非银行金融': {
            '004025002001': '保险',
            '004025002002': '证券',
            '004025002003': '信托',
            '004025002004': '其他非银行金融',
            '004025002005': 'PE、VC投资'
        }
    }},

    {'房地产': {
        '房地产开发': {
            '004026001001': '房地产开发',
            '004026001002': '园区开发'
        },
        '房地产服务': {
            '004026002002': '房地产服务'
        }
    }},

    {'综合': {
        '综合': {
            '004027001001': '综合'
        }
    }}
]

EMQuantCodesList_Concept = [
    # 概念类
    {'概念类': {
        '007001': '军工',
        '007002': '高校',
        '007003': '煤化工',
        '007004': '新能源',
        '007005': '节能环保',
        '007007': 'AB股',
        '007008': 'AH股',
        '007009': 'HS300_',
        '007010': '次新股',
        '007013': '中字头',
        '007014': '创投',
        '007017': '网络游戏',
        '007019': 'ST概念',
        '007020': '化工原料',
        '007022': '参股券商',
        '007024': '稀缺资源',
        '007025': '社保重仓',
        '007028': '新材料',
        '007029': '参股期货',
        '007030': '参股银行',
        '007032': '转债标的',
        '007033': '成渝特区',
        '007034': 'QFII重仓',
        '007035': '基金重仓',
        '007038': '黄金概念',
        '007039': '生物疫苗',
        '007040': '深圳特区',
        '007043': '机构重仓',
        '007045': '物联网',
        '007046': '移动支付',
        '007047': '基本金属',
        '007048': '油价相关',
        '007049': '滨海新区',
        '007050': '股权激励',
        '007051': '深成500',
        '007053': '预亏预减',
        '007054': '预盈预增',
        '007057': '锂电池',
        '007058': '核能核电',
        '007059': '稀土永磁',
        '007060': '云计算',
        '007061': 'LED',
        '007062': '智能电网',
        '007068': '太阳能',
        '007072': '铁路基建',
        '007074': '长江三角',
        '007075': '风能',
        '007076': '融资融券',
        '007077': '水利建设',
        '007079': '新三板',
        '007080': '海工装备',
        '007082': '页岩气',
        '007083': '参股保险',
        '007085': '油气设服',
        '007089': '央视50_',
        '007090': '上证50_',
        '007091': '上证180_',
        '007093': '食品安全',
        '007094': '中药',
        '007096': '石墨烯',
        '007098': '3D打印',
        '007099': '地热能',
        '007100': '海洋经济',
        '007102': '通用航空',
        '007103': '美丽中国',
        '007104': '智慧城市',
        '007105': '北斗导航',
        '007108': '土地流转',
        '007109': '送转预期',
        '007110': '大数据',
        '007111': '中超概念',
        '007112': 'B股',
        '007113': '互联金融',
        '007114': '创业成份',
        '007116': '智能机器',
        '007117': '智能穿戴',
        '007118': '手游概念',
        '007119': '上海自贸',
        '007120': '特斯拉',
        '007122': '养老概念',
        '007124': '网络安全',
        '007125': '智能电视',
        '007131': '在线教育',
        '007132': '油改概念',
        '007133': '二胎概念',
        '007137': '电商概念',
        '007136': '苹果概念',
        '007138': '国家安防',
        '007139': '医疗器械',
        '007140': '生态农业',
        '007142': '彩票概念',
        '007143': '沪企改革',
        '007145': '蓝宝石',
        '007146': '病毒防治',
        '007147': '独家药品',
        '007148': '粤港自贸',
        '007149': '超导概念',
        '007150': '智能家居',
        '007152': '燃料电池',
        '007153': '国企改革',
        '007154': '京津冀',
        '007155': '举牌概念',
        '007159': '阿里概念',
        '007160': '氟化工',
        '007161': '在线旅游',
        '007162': '基因测序',
        '007164': '小金属',
        '007165': '国产软件',
        '007166': 'IPO受益',
        '007167': '免疫治疗',
        '007168': '全息技术',
        '007169': '充电桩',
        '007170': '中证500',
        '007172': '超级电容',
        '007173': '无人机',
        '007174': '上证380',
        '007175': '人脑工程',
        '007176': '沪股通',
        '007177': '体育产业',
        '007178': '赛马概念',
        '007179': '量子通信',
        '007180': '券商概念',
        '007181': '一带一路',
        '007182': '2025规划',
        '007183': '5G概念',
        '007184': '航母概念',
        '007186': '北京冬奥',
        '007187': '证金持股',
        '007188': '健康中国',
        '007190': 'PPP模式',
        '007191': '虚拟现实',
        '007192': '高送转',
        '007193': '海绵城市',
        '007195': '人工智能',
        '007196': '增强现实',
        '007197': '无人驾驶',
        '007198': '工业4.0',
        '007199': '壳资源',
        '007200': '区块链',
        '007201': 'OLED',
        '007202': '单抗概念',
        '007203': '3D玻璃',
        '007204': '猪肉概念',
        '007205': '国产芯片',
        '007206': '新能源车',
        '007207': '车联网',
        '007209': '网红直播',
        '007210': '草甘膦',
        '007211': '无线充电',
        '007212': '生物识别',
        '007213': '债转股',
        '007214': '快递概念',
        '007215': '股权转让',
        '007216': '深股通',
        '007217': '钛白粉',
        '007218': '精准医疗',
        '007219': '共享经济',
        '007220': '军民融合',
        '007221': '超级品牌',
        '007222': '贬值受益',
        '007223': '雄安新区',
        '007224': '大飞机',
        '007225': '昨日涨停',
        '007226': '昨日连板',
        '007227': '昨日触板',
        '007228': '可燃冰',
        '007230': 'MSCI中国',
        '007231': '创业板综',
        '007232': '深证100R',
        '007233': '租售同权',
        '007234': '养老金',
        '007235': '参股360',
        '007236': '新零售',
        '007237': '万达概念',
        '007238': '工业互联',
        '007239': '小米概念',
        '007240': '乡村振兴',
        '007241': '独角兽',
        '007242': '数字中国',
        '007243': '互联医疗',
        '007244': '东北振兴',
        '007245': '知识产权',
        '007246': '体外诊断',
        '007247': '富士康',
        '007248': '天然气',
        '007249': '百度概念',
        '007251': '影视概念',
        '007253': '京东金融',
        '007254': '进口博览',
        '007255': '纾困概念',
        '007256': '冷链物流',
        '007257': '电子竞技',
        '007258': '华为概念',
        '007259': '纳米银',
        '007260': '工业大麻',
        '007261': 'MSCI大盘',
        '007262': 'MSCI中盘',
        '007263': '超清视频',
        '007264': '边缘计算',
        '007265': '数字孪生',
        '007266': '超级真菌',
        '007267': '透明工厂',
        '007268': '氢能源',
        '007269': '电子烟',
        '007270': '人造肉',
        '007271': '富时概念',
        '007272': 'GDR概念',
        '007275': '青蒿素',
        '007276': '垃圾分类',
        '007277': '创业板壳',
        '007278': 'ETC',
        '007280': 'PCB',
        '007281': '分拆预期',
        '007282': '标普概念',
        '007283': 'UWB概念',
        '007284': '数字货币',
        '007285': '光刻胶',
        '007286': 'VPN',
        '007287': '智慧政务',
        '007288': '鸡肉概念',
        '007289': '农业种植',
        '007290': '医疗美容',
        '007291': 'MLCC',
        '007292': '乳业',
        '007293': '无线耳机',
        '007294': '阿兹海默',
        '007295': '维生素',
        '007296': '白酒',
        '007297': 'IPv6',
        '007298': '胎压监测',
        '007299': 'CRO',
        '007300': '3D摄像头',
        '007301': 'MiniLED',
        '007302': '云游戏',
        '007303': '广电',
        '007304': '传感器',
        '007305': '流感',
        '007306': '转基因'
    }}
]